In [2]:
import pandas as pd
import numpy as np

In [3]:
pip install kagglehub

Requirement already satisfied: kagglehub in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (0.3.12)
Requirement already satisfied: packaging in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from kagglehub) (24.1)
Requirement already satisfied: pyyaml in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from kagglehub) (6.0.2)
Requirement already satisfied: requests in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from kagglehub) (2.32.3)
Requirement already satisfied: tqdm in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from kagglehub) (4.66.5)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from requests->kagglehub) (3.4.0)
Requirement already satisfied: idna<4,>=2.5 in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from requests->kagglehub) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from requests->kagglehub) (2.2.3)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from requests->kagglehub) (2024.8.30)
Requirement already satisfied: colorama in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from tqdm->kagglehub) (0.4.6)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("jahias/microsoft-adventure-works-cycles-customer-data")

print("Path to dataset files:", path)

Path to dataset files: C:\Users\Gunee\.cache\kagglehub\datasets\jahias\microsoft-adventure-works-cycles-customer-data\versions\1

In [5]:
path_customers=r"C:\Users\Gunee\.cache\kagglehub\datasets\jahias\microsoft-adventure-works-cycles-customer-data\versions\1\AWCustomers.csv"
df1=pd.read_csv(path_customers)
df1.head(7)

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06
5,22092,NaN,Andrea,NaN,Young,NaN,9384 Ashmount Way,NaN,Tacoma,Washington,...,High School,Skilled Manual,F,M,1,2,2,2,61944,2017-03-06
6,11229,NaN,Adrian,C,Stewart,NaN,6898 Shaw Rd.,NaN,Redwood City,California,...,Partial College,Manual,M,S,1,1,0,0,34919,2017-03-06

In [6]:
path_sales=r"C:\Users\Gunee\.cache\kagglehub\datasets\jahias\microsoft-adventure-works-cycles-customer-data\versions\1\AWSales.csv"
df2=pd.read_csv(path_sales)
df2.head(9)

   CustomerID  BikeBuyer  AvgMonthSpend
0       21173          1          50.97
1       13249          1          53.11
2       29350          1          54.08
3       13503          1          56.93
4       22803          1          55.41
5       22092          1          49.31
6       11229          0          56.01
7       24179          1          49.29
8       12127          1          50.05

In [7]:
path_test_class=r"C:\Users\Gunee\.cache\kagglehub\datasets\jahias\microsoft-adventure-works-cycles-customer-data\versions\1\AWTest-Classification.csv"
df3=pd.read_csv(path_test_class)
df3.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,11219,NaN,Charles,NaN,Cook,NaN,6871 Bel Air Dr.,NaN,Woodburn,Oregon,...,High School,Skilled Manual,M,M,1,2,2,2,56100,2017-03-06
1,11241,NaN,Lisa,NaN,Cai,NaN,"102, rue de Berri",NaN,Les Ulis,Essonne,...,Partial College,Skilled Manual,F,S,1,0,0,0,61555,2017-03-06
2,11352,NaN,Raymond,A,Rodriguez,NaN,"24, impasse Ste-Madeleine",NaN,Pantin,Seine Saint Denis,...,Partial College,Clerical,M,M,1,3,0,2,83613,2017-03-06
3,11904,NaN,Kaylee,NaN,Cook,NaN,5742 Curtis Drive,NaN,Geelong,Victoria,...,Graduate Degree,Professional,F,S,1,2,0,0,130551,2017-03-06
4,11908,NaN,Rafael,A,Tang,NaN,8839 Leonard Dr,NaN,South Melbourne,Victoria,...,Graduate Degree,Professional,M,S,1,2,0,0,135915,2017-03-06

In [8]:
path_test_regression=r"C:\Users\Gunee\.cache\kagglehub\datasets\jahias\microsoft-adventure-works-cycles-customer-data\versions\1\AWTest-Regression.csv"
df4=pd.read_csv(path_test_regression)
df4.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,11908,NaN,Rafael,A,Tang,NaN,8839 Leonard Dr,NaN,South Melbourne,Victoria,...,Graduate Degree,Professional,M,S,1,2,0,0,135915,2017-03-06
1,12286,NaN,Nathan,M,Jenkins,NaN,3093 Roland Drive,NaN,Peterborough,England,...,Graduate Degree,Professional,M,S,1,2,0,0,137732,2017-03-06
2,12892,NaN,Brian,NaN,Peterson,NaN,1284 Poppy Pl.,NaN,Royal Oak,British Columbia,...,Graduate Degree,Professional,M,M,1,2,0,0,135404,2017-03-06
3,14698,NaN,Diane,NaN,Navarro,NaN,Potsdamer Straße 92324,NaN,Frankfurt am Main,Saarland,...,Bachelors,Management,F,M,1,3,0,0,104040,2017-03-06
4,15085,NaN,Kristin,H,Jai,NaN,"88, impasse Notre-Dame",NaN,Morangis,Essonne,...,Graduate Degree,Professional,F,S,1,0,0,0,129319,2017-03-06

In [9]:
print(df1.columns.tolist())

['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix', 'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName', 'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate', 'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren', 'YearlyIncome', 'LastUpdated']

In [75]:
print(df4.columns.tolist())

['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix', 'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName', 'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate', 'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren', 'YearlyIncome', 'LastUpdated']

# PART I

In [10]:
selected_features = [
   'FirstName', 'LastName', 'AddressLine1', 'City', 'StateProvinceName', 'CountryRegionName', 'PostalCode', 'BirthDate', 'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren', 'YearlyIncome', 'LastUpdated'
]
df1=df1[selected_features]

In [11]:
df1.head()

,FirstName,LastName,AddressLine1,City,StateProvinceName,CountryRegionName,PostalCode,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,Chad,Yuan,7090 C. Mount Hood,Wollongong,New South Wales,Australia,2500,1987-11-13,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,Ryan,Perry,3651 Willow Lake Rd,Shawnee,British Columbia,Canada,V9B 2C3,1972-07-21,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,Julia,Thompson,1774 Tice Valley Blvd.,West Covina,California,United States,91791,1985-11-09,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,Theodore,Gomez,2103 Baldwin Dr,Liverpool,England,United Kingdom,L4 4HB,1977-10-18,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,Marshall,Shan,Am Gallberg 234,Werne,Nordrhein-Westfalen,Germany,59368,1975-02-05,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

# PART II

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18361 entries, 0 to 18360
Data columns (total 18 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   FirstName             18361 non-null  object
 1   LastName              18361 non-null  object
 2   AddressLine1          18361 non-null  object
 3   City                  18361 non-null  object
 4   StateProvinceName     18361 non-null  object
 5   CountryRegionName     18361 non-null  object
 6   PostalCode            18361 non-null  object
 7   BirthDate             18361 non-null  object
 8   Education             18361 non-null  object
 9   Occupation            18361 non-null  object
 10  Gender                18361 non-null  object
 11  MaritalStatus         18361 non-null  object
 12  HomeOwnerFlag         18361 non-null  int64
 13  NumberCarsOwned       18361 non-null  int64
 14  NumberChildrenAtHome  18361 non-null  int64
 15  TotalChildren         18361 non-null  int64
 16  YearlyIncome          18361 non-null  int64
 17  LastUpdated           18361 non-null  object
dtypes: int64(5), object(13)
memory usage: 2.5+ MB

### a)NO NULL VALUES

### b)NORMALIZATION:

In [19]:
df1.loc[:,'YearlyIncome'] = df1['YearlyIncome']/df1['YearlyIncome'].max()

In [20]:
df1['YearlyIncome'].head(10)

0    0.588837
1    0.582798
2    0.620975
3    0.441944
4    0.372383
5    0.445272
6    0.251008
7    0.444467
8    0.602624
9    0.193221
Name: YearlyIncome, dtype: float64

In [21]:
df1.loc[:,'NumberCarsOwned'] = df1['NumberCarsOwned']/df1['NumberCarsOwned'].max()
df1['NumberCarsOwned'].head(10)

0    0.6
1    0.4
2    0.6
3    0.4
4    0.2
5    0.4
6    0.2
7    0.2
8    0.0
9    0.2
Name: NumberCarsOwned, dtype: float64

In [22]:
df1.loc[:,'TotalChildren'] = df1['TotalChildren']/df1['TotalChildren'].max()
df1['TotalChildren'].head(10)

0    0.333333
1    0.666667
2    0.000000
3    0.666667
4    0.000000
5    0.666667
6    0.000000
7    0.000000
8    0.666667
9    0.000000
Name: TotalChildren, dtype: float64

### c)BINNING:

In [27]:
pip install datetime

Collecting datetime
  Downloading DateTime-5.5-py3-none-any.whl.metadata (33 kB)
Collecting zope.interface (from datetime)
  Downloading zope.interface-7.2-cp312-cp312-win_amd64.whl.metadata (45 kB)
Requirement already satisfied: pytz in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from datetime) (2024.2)
Requirement already satisfied: setuptools in c:\users\gunee\appdata\local\programs\python\python312\lib\site-packages (from zope.interface->datetime) (75.2.0)
Downloading DateTime-5.5-py3-none-any.whl (52 kB)
Downloading zope.interface-7.2-cp312-cp312-win_amd64.whl (212 kB)
Installing collected packages: zope.interface, datetime

   ---------------------------------------- 0/2 [zope.interface]
   ---------------------------------------- 0/2 [zope.interface]
   ---------------------------------------- 0/2 [zope.interface]
   ---------------------------------------- 0/2 [zope.interface]
   ---------------------------------------- 0/2 [zope.interface]
   ---------------------------------------- 0/2 [zope.interface]
   ---------------------------------------- 0/2 [zope.interface]
   ---------------------------------------- 0/2 [zope.interface]
   ---------------------------------------- 0/2 [zope.interface]
   ---------------------------------------- 0/2 [zope.interface]
   -------------------- ------------------- 1/2 [datetime]
   -------------------- ------------------- 1/2 [datetime]
   ---------------------------------------- 2/2 [datetime]

Successfully installed datetime-5.5 zope.interface-7.2
Note: you may need to restart the kernel to use updated packages.

In [29]:
import pandas as pd
from datetime import datetime

# Ensure BirthDate is converted properly
df1['BirthDate'] = pd.to_datetime(df1['BirthDate'], errors='coerce')

# Check if conversion worked
print(df1['BirthDate'].head())

# Drop rows where conversion failed (optional)
df1 = df1.dropna(subset=['BirthDate'])

# Calculate age
today = pd.Timestamp.today()
df1['Age'] = (today - df1['BirthDate']).dt.days // 365

print(df1[['BirthDate', 'Age']].head())

0   1987-11-13
1   1972-07-21
2   1985-11-09
3   1977-10-18
4   1975-02-05
Name: BirthDate, dtype: datetime64[ns]
   BirthDate  Age
0 1987-11-13   37
1 1972-07-21   53
2 1985-11-09   39
3 1977-10-18   47
4 1975-02-05   50

In [30]:
bins = [0, 18, 50, df1['Age'].max() ]
GroupNames = ['Young', 'Adult', 'Senior']
df1['AgeBins'] =pd.cut(df1['Age'], bins, labels=GroupNames, include_lowest=True)
df1[['Age', 'AgeBins']].head()

   Age AgeBins
0   37   Adult
1   53  Senior
2   39   Adult
3   47   Adult
4   50   Adult

In [35]:
df1['YearlyIncome'].max

<bound method Series.max of 0        0.588837
1        0.582798
2        0.620975
3        0.441944
4        0.372383
           ...
18356    0.380642
18357    0.438429
18358    0.372778
18359    0.626654
18360    0.983762
Name: YearlyIncome, Length: 18361, dtype: float64>

In [38]:
arr=np.linspace(0,1,4)
print(arr)

[0.         0.33333333 0.66666667 1.        ]

In [41]:
bins = arr
GroupNames = ['High Income', 'Medium Income', 'Low Income']
df1['IncomeCat'] =pd.cut(df1['YearlyIncome'], bins, labels=GroupNames, include_lowest=True)
df1[['YearlyIncome', 'IncomeCat']].head(10)

   YearlyIncome      IncomeCat
0      0.588837  Medium Income
1      0.582798  Medium Income
2      0.620975  Medium Income
3      0.441944  Medium Income
4      0.372383  Medium Income
5      0.445272  Medium Income
6      0.251008    High Income
7      0.444467  Medium Income
8      0.602624  Medium Income
9      0.193221    High Income

### D)Standardization

In [56]:
df1[['YearlyIncome','Age']]=df1[['YearlyIncome', 'Age']].astype(float)

In [57]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
df=df1.loc[:,['Age','YearlyIncome']]
df.loc[:,['Age','YearlyIncome']]=scaler.fit_transform(df1[['Age','YearlyIncome']])
df.head()

        Age  YearlyIncome
0 -0.542546      -0.00738
1  0.877383      -0.00738
2 -0.365055      -0.00738
3  0.344910      -0.00738
4  0.611147      -0.00738

### E)Binarization

#### i)Using Pandas

In [64]:
encoded_df=pd.get_dummies(df1, columns=['Gender', 'MaritalStatus'],drop_first=True)
encoded_df.head()

,FirstName,LastName,AddressLine1,City,StateProvinceName,CountryRegionName,PostalCode,BirthDate,Education,Occupation,...,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated,Age,AgeBins,IncomeCat,Gender_M,MaritalStatus_S
0,Chad,Yuan,7090 C. Mount Hood,Wollongong,New South Wales,Australia,2500,1987-11-13,Bachelors,Clerical,...,0.6,0,0.333333,0.0,2017-03-06,37.0,Adult,Medium Income,True,False
1,Ryan,Perry,3651 Willow Lake Rd,Shawnee,British Columbia,Canada,V9B 2C3,1972-07-21,Partial College,Clerical,...,0.4,1,0.666667,0.0,2017-03-06,53.0,Senior,Medium Income,True,False
2,Julia,Thompson,1774 Tice Valley Blvd.,West Covina,California,United States,91791,1985-11-09,Bachelors,Clerical,...,0.6,0,0.000000,0.0,2017-03-06,39.0,Adult,Medium Income,False,True
3,Theodore,Gomez,2103 Baldwin Dr,Liverpool,England,United Kingdom,L4 4HB,1977-10-18,Partial College,Skilled Manual,...,0.4,1,0.666667,0.0,2017-03-06,47.0,Adult,Medium Income,True,False
4,Marshall,Shan,Am Gallberg 234,Werne,Nordrhein-Westfalen,Germany,59368,1975-02-05,Partial College,Skilled Manual,...,0.2,0,0.000000,0.0,2017-03-06,50.0,Adult,Medium Income,True,True

#### ii)Using Sklearn OneHotEncoder

In [72]:
from sklearn.preprocessing import OneHotEncoder
encoder= OneHotEncoder(drop="first",sparse_output=False)
encoded=encoder.fit_transform(df1[['Gender','MaritalStatus']])
encoded_df = pd.DataFrame(encoded, columns=encoder.get_feature_names_out(['Gender', 'MaritalStatus']))
df_encoded = pd.concat([df1.drop(['Gender', 'MaritalStatus'], axis=1), encoded_df], axis=1)
df_encoded.head()

,FirstName,LastName,AddressLine1,City,StateProvinceName,CountryRegionName,PostalCode,BirthDate,Education,Occupation,...,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated,Age,AgeBins,IncomeCat,Gender_M,MaritalStatus_S
0,Chad,Yuan,7090 C. Mount Hood,Wollongong,New South Wales,Australia,2500,1987-11-13,Bachelors,Clerical,...,0.6,0,0.333333,0.0,2017-03-06,37.0,Adult,Medium Income,1.0,0.0
1,Ryan,Perry,3651 Willow Lake Rd,Shawnee,British Columbia,Canada,V9B 2C3,1972-07-21,Partial College,Clerical,...,0.4,1,0.666667,0.0,2017-03-06,53.0,Senior,Medium Income,1.0,0.0
2,Julia,Thompson,1774 Tice Valley Blvd.,West Covina,California,United States,91791,1985-11-09,Bachelors,Clerical,...,0.6,0,0.000000,0.0,2017-03-06,39.0,Adult,Medium Income,0.0,1.0
3,Theodore,Gomez,2103 Baldwin Dr,Liverpool,England,United Kingdom,L4 4HB,1977-10-18,Partial College,Skilled Manual,...,0.4,1,0.666667,0.0,2017-03-06,47.0,Adult,Medium Income,1.0,0.0
4,Marshall,Shan,Am Gallberg 234,Werne,Nordrhein-Westfalen,Germany,59368,1975-02-05,Partial College,Skilled Manual,...,0.2,0,0.000000,0.0,2017-03-06,50.0,Adult,Medium Income,1.0,1.0

# PART 3

### a)

In [85]:
obj1 = df_encoded.iloc[0].values
obj2 = df_encoded.iloc[1].values

# --- Simple Matching Coefficient (SMC) ---
matches = np.sum(obj1 == obj2)
smc = matches / len(obj1)
print(smc)

0.3333333333333333

In [86]:
# --- Jaccard Similarity ---
intersection = np.sum((obj1 == 1) & (obj2 == 1))
union = np.sum((obj1 == 1) | (obj2 == 1))
jaccard = intersection / union if union != 0 else 0
print(jaccard)

0.6666666666666666

In [94]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

# 1. Drop useless columns
df_clean = df_encoded.drop(columns=['FirstName', 'LastName', 'AddressLine1', 
                            'City', 'StateProvinceName', 
                            'CountryRegionName', 'PostalCode', 
                            'BirthDate'])

# 2. Separate categorical and numeric
categorical_cols = ['Education', 'Occupation', 'AgeBins', 'IncomeCat']
numeric_cols = ['HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome', 
                'TotalChildren', 'YearlyIncome', 'Age']

# 3. One-Hot Encode categorical columns
encoder = OneHotEncoder(drop='first', sparse_output=False)
encoded = encoder.fit_transform(df_clean[categorical_cols])
encoded_df = pd.DataFrame(encoded, columns=encoder.get_feature_names_out(categorical_cols))

# 4. Merge back with numeric features
df_ready = pd.concat([df_clean[numeric_cols].reset_index(drop=True), encoded_df], axis=1)

In [96]:
#--- Cosine Similarity ---
obj1 = df_ready.iloc[0].values
obj2 = df_ready.iloc[1].values
from sklearn.metrics.pairwise import cosine_similarity
cosine=cosine_similarity([obj1],[obj2])[0][0]
print(cosine)

0.9993567107794393

### b)

In [100]:
print(df1['YearlyIncome'].corr(df1['NumberCarsOwned']))

0.0139670630985174